{
  "posts": [
{
  "id": "2025-05-12-patch-0-1-4",
  "date": "12/05/2025",
  "category": "Notícias",
  "title": "Patch 0.1.4 — Backend Base Finalizado",
  "content": "<p>Concluímos oficialmente a Etapa 1 do backend NoHeroes! Agora o servidor local está funcionando de forma completa e estável.</p><p>Status do progresso técnico:</p><ul><li>Backend funcional com Express + Sequelize ✅</li><li>Banco sincronizado sem apagar dados ✅</li><li>Registro de usuário seguro com bcrypt ✅</li><li>Login com JWT token ✅</li><li>Autenticação via middleware ✅</li><li>Remoção do password no profile ✅</li><li>Padronização de respostas JSON ✅</li><li>PM2 rodando e monitorando backend ✅</li></ul><p>A base do backend NoHeroes está oficialmente pronta para avançar para a próxima fase de desenvolvimento!</p>"
},
{
      "id": "2025-05-10-patch-0-1-3",
      "date": "10/05/2025",
      "category": "Notícias",
      "title": "Patch 0.1.3 — Novo Servidor",
      "content": "<p>Como foi informado no patch 0.1.2, a adição de contas e login está sendo feito. Entretanto como pelo github nossos recursos são mais limitado, decidimos fazer um servidor local. esse será temporário e improvisado até que consigamos investimento o suficiente para fazer um upgrade nos aparelhos que sustentarão toda essa estrutura. estamos ansiosos pelo que está chegando para vocês! SDS NoHeroe!</p>"
    },
{
      "id": "2025-05-10-patch-0-1-2",
      "date": "10/05/2025",
      "category": "Atualizações",
      "title": "Patch 0.1.2 — Sobre NoHeroes,conta, login e perfil",
      "content": "<p>Adicionamos informações e polimos a página sobre, que agora está completa! Adicionamos as páginas login, registrar e perfil, onde já é visível a estrutura futura de como funcionará nosso sistema futuro, entretanto ainda está no rascunho. Obs: também adicionamos as páginas termos e política de privacidade.</p>"
    },
    {
      "id": "2025-05-07-patch-0-1-1",
      "date": "07/05/2025",
      "category": "Atualizações",
      "title": "Patch 0.1.1 — Colaboradores, Parceiros & Apoiadores",
      "content": "<p>Adicionamos a página Parceiros e Colaboradores de forma ilustrada para exposição. Deixamos também um aviso, temos apenas 20 vagas para colaboradores, e não aceitaremos qualquer pessoa participando ativamente do projeto. Alem disso a Página de Apoio foi atualizada e completamente finalizada. Agora vcs podem entrar em contato diretamente conosco por lá! Página de agradecimento também foi adicionada e finalizada! Desejamos uma ótima Noite, e Obrigado pelo apoio! Sds NoHeroe.</p>"
    },
{
      "id": "2025-05-06-patch-0-1-0",
      "date": "06/05/2025",
      "category": "Atualizações",
      "title": "Patch 0.1.0 — Portifólio & Linktree",
      "content": "<p>Incluímos a página Portifólio em nosso site, para separar os conteúdos devidamente. A Linktree foi redecorada e sistema audiovisual foi implementado de forma profissional. Aguardem as próximas Atualizações. SDS NoHeroe.</p>"
    },
{
      "id": "2025-05-04-patch-0-0-9",
      "date": "04/05/2025",
      "category": "Atualizações",
      "title": "Patch 0.0.9 — Página FREQ e próximas",
      "content": "<p>A Página FREQ foi completamente atualizada, implementação de conteúdos e estrutura foram atualizados. fluidez e organização da página foram melhorados.A página Sobre passará pelo mesmo polimento. mais informações serão liberadas logo. grato por acompanhar.</p>"
    },
{
      "id": "2025-05-02-patch-0-0-8",
      "date": "02/05/2025",
      "category": "Atualizações",
      "title": "Patch 0.0.8 — Página ROAR e próximas",
      "content": "<p>A Página ROAR foi completamente atualizada, implementação de conteúdos e estrutura foram atualizados. fluidez e organização da página foram melhorados.A página FREQ passará pelo mesmo polimento. mais informações serão liberadas logo. grato por acompanhar.</p>"
    },
{
      "id": "2025-04-30-patch-0-0-7",
      "date": "30/04/2025",
      "category": "Atualizações",
      "title": "Patch 0.0.7 — Página Home",
      "content": "<p>O restante das alterações da página home foram concluídas. Com isso a entrada da página é a primeira página Completa, faltando apenas imagens e animações.</p>"
    },
    {
      "id": "2025-04-30-patch-0-0-6",
      "date": "30/04/2025",
      "category": "Atualizações",
      "title": "Patch 0.0.6 — Página Home",
      "content": "<p>Refizemos a página Home com a proposta de tornar ela mais dinâmica e navegável. alguns botões não estão funcionando por faltarem as páginas respectivas. adicionamos também uma página esteregg e adicionamos uma opção de notificação simples no topo da página.</p>"
    },
    {
      "id": "2025-04-29-patch-0-0-5",
      "date": "29/04/2025",
      "category": "Notícias",
      "title": "Patch 0.0.5 — Próximas mudanças e avisos",
      "content": "<p>Páginas a serem implementadas e polidas a seguir,Página Home,Página ROAR, Página FREQ, Página Apoio Vitalista, Página Sobre, Página linktree, Página Loja, Página Loja Conteúdo Físico, Página Loja Conteúdo Digital, Página Login & Conta, Página Meu Perfil, Página Meu Conteúdo, Página Meu Personagem, Página Oráculo, Página Explorar Caelum, Página Jogar No Heroes, Página Conquistas, Página Missões e Tarefas, Página Conteúdo, Página Blog. Estamos ansiosos pela interação de vcs!</p>"
    },
    {
      "id": "2025-04-29-patch-0-0-4",
      "date": "29/04/2025",
      "category": "Atualizações",
      "title": "Patch 0.0.4 — Correções e novas páginas",
      "content": "<p>Adicionamos um novo código que acelera a publicação de posts novos. Criamos a página Sobre, a qual ainda está tendo inconsistências visuais.</p>"
    },
    {
      "id": "2025-04-27-patch-0-0-3",
      "date": "27/04/2025",
      "category": "Atualizações",
      "title": "Patch 0.0.3 — Melhorias na Navegação",
      "content": "<p>Adicionamos um sistema de navegação para facilitar a inspeção dos conteúdos do blog.</p>"
    },
    {
      "id": "2025-04-27-patch-0-0-2",
      "date": "27/04/2025",
      "category": "Atualizações",
      "title": "Patch 0.0.2 — Página de Notícias Adicionada",
      "content": "<p>Uma nova seção de Notícias foi adicionada, com modal e filtro por categoria.</p>"
    },
    {
      "id": "2025-04-24-patch-0-0-1",
      "date": "24/04/2025",
      "category": "Notícias",
      "title": "Patch 0.0.1 — Lançamento do Site",
      "content": "<p>O site oficial da NoHeroes foi lançado com design dark e funcionalidades básicas de blog!</p>"
    }
  ]
}
